#### [결측치 처리]
- 빈 칸 즉, 데이터가 없는 부분을 의미
- 결측치 체크 후 처리 방법 결정
- 처리 방법 :

In [56]:
# [1] 모듈 로딩
import pandas as pd

In [57]:
# [2] 데이터 준비
file_name = "data.csv"

In [58]:
# [3] CSV => DataFrame으로 저장
dataDF = pd.read_csv(file_name)

In [59]:
# [4] 데이터 기본정보 확인
dataDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   no      5 non-null      int64
 1   name    4 non-null      object
 2   age     4 non-null      float64
 3   gender  5 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 288.0+ bytes

In [60]:
dataDF.isna()

      no   name    age  gender
0  False  False  False   False
1  False   True  False   False
2  False  False  False   False
3  False  False  False   False
4  False  False   True   False

In [61]:
dataDF.isna().sum()

no        0
name      1
age       1
gender    0
dtype: int64

In [62]:
# - [5-2] 결측치 처리 -> 방법 1) 삭제 dropna()메서드
# - 기본값 : 행방향, 행 안에 1개의 컬럼이라도 NA면 삭제
dataDF.dropna()

   no  name   age gender
0   1  Hong  10.0      F
2   3   Kim  12.0      M
3   4   Lee  16.0      F

In [63]:
# - 설정값 : 열방향, 열 안에 1개의 원소라도 Na면 삭제
dataDF.dropna(axis=1)

   no gender
0   1      F
1   2      M
2   3      M
3   4      F
4   5      M

In [64]:
# - 설정값 : 모든 원소가 NaN일때 삭제 how = "all"
dataDF.dropna(axis = 0, how = "all")

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      M
2   3   Kim  12.0      M
3   4   Lee  16.0      F
4   5   Lim   NaN      M

In [65]:
# - 설정값 : 정상데이터가 지정된 개수 이하이면 삭제
dataDF.dropna(axis = 0, thresh = 4)

   no  name   age gender
0   1  Hong  10.0      F
2   3   Kim  12.0      M
3   4   Lee  16.0      F

In [66]:
# - 설정값 : 특정 컬럼만 NaN 여부 검사 진행 후 결정 : subset
# - 나이를 분석하고 싶음 => 중요한 컬럼 age
dataDF.dropna(axis = 0, subset = ["age"])

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      M
2   3   Kim  12.0      M
3   4   Lee  16.0      F

In [67]:
# - 나이를 분석하고 싶음 => 중요한 컬럼 age
dataDF.dropna(axis = 0, subset = ["age"])

   no  name   age gender
0   1  Hong  10.0      F
1   2   NaN  13.0      M
2   3   Kim  12.0      M
3   4   Lee  16.0      F

In [68]:
# - [5 - 2] 결측치 처리 -> 바법 1) 댜체 / 치환 fillna() 메서드
# - 대체값 : 원하는 값 또는 컬럼의 평균값 / 최빈값 등을 사용 가능
#            이전의 값 또는 이후의 값으로 대체
dataDF.fillna({"name": "unkonwn", "age" : 0})

   no     name   age gender
0   1     Hong  10.0      F
1   2  unkonwn  13.0      M
2   3      Kim  12.0      M
3   4      Lee  16.0      F
4   5      Lim   0.0      M

In [69]:
dataDF.fillna(method = "ffill") # 미래에 제거되는 매개변수 method
dataDF.ffill()

C:\Users\KDP-2\AppData\Local\Temp\ipykernel_15804\3317579516.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  dataDF.fillna(method = "ffill") # 미래에 제거되는 매개변수 method

   no  name   age gender
0   1  Hong  10.0      F
1   2  Hong  13.0      M
2   3   Kim  12.0      M
3   4   Lee  16.0      F
4   5   Lim  16.0      M

In [70]:
dataDF.bfill()

   no  name   age gender
0   1  Hong  10.0      F
1   2   Kim  13.0      M
2   3   Kim  12.0      M
3   4   Lee  16.0      F
4   5   Lim   NaN      M

In [83]:
# 나이의 결측치는 나이 평균으로 채우기
dataDF.fillna({"age" : dataDF["age"].mean()}, inplace = True)

In [86]:
# 이름의 결측치는 가장 많이 사용된 이름으로 채우기
dataDF.fillna({"name" : dataDF["name"].mode()}, inplace = True)

In [87]:
dataDF

   no  name    age gender
0   1  Hong  10.00      F
1   2   Kim  13.00      M
2   3   Kim  12.00      M
3   4   Lee  16.00      F
4   5   Lim  12.75      M